#دستورات اولیه شروع پایتون از صفر
print('hello word')
#در تعریف یک متغیر باید توجه کرد که نمیتوان با عدد شروع کرد و همچنین باید و همچنین استفاده از نماد های خاص امگتن پذیر نیست
#   k$=11:مثال
# بین a,Aتفاوت است 
#حساس به حروف کوچک و بزرگ
a=10
b=10
print(id(a))
print(id(b))
#سوال پیشامده چرا ادرس فیزیکی ان برابر است
if id(a)==id(b):
    print("ali")
#وقتی مقدار یک متغیر یا یک شی یکی باشد در نتیجه ادرس ان ها نیز در پایتون یکی در نظر پرفته میشود
a+=10
#ام در اینجا چون مقدار تغیر یافته در نتیجه ادرس فیزیکی مجزای خود را دارد
if id(a)==id(b):
    print("ali")
print(id(a))
#  پایتون قابلیت پشتیبانی از زبان فارسی را دارد و نکته دیگر که قابل اهمیت میباشد این است کهبین تک کوتیشن و دبل کوتیشن فرق نمیگذارد
s=a+b
print('جمع',a,",",b,"میشود",s)#در این کد چون از زبان پشتیبانی میشود به صورت فارسی جمله نوشته میشود
#انواع داده ها شامل دو نوع اصلی و غیر اصلی است (primitive and Nun primitive)
'''
            -->integer-->int
            -->float-->float
primitive:-|
            -->string--->str
            -->bool---->bool
    ______________________________________
               -->list--------->list
               -->tuple---- -->tuple
Nun primitive:|
               -->set--------- ->set
               -->dictionary -->dict
    ______________________________________
'''
#در بالا یاد گرفتیم که با گذاشتن سه عدد تک کوتیشن میتوتنیم کامنت های طولانی بنویسیم
# خود #هم  که در توضیحات استفاده گردیده بیانگر کامنت های تک خطی میباشد
#دستور بعدی دستورtypy
print(type(a),type(b))
string="Karo Jafari"
print(type(string))
'''
:  برنامه ای بنویسید که طول و عرض مسطتیل را از کاربر دریافت بکند 
                :محیط را بدست اورید
                :مساحت را بدست اورید
'''
#گرفتن ورودی مساحت و محیط از کاربر با دستور (input)
#نکته قابل اهمیت این است که قبل از دریافت ورودی باید بگویید که چه نوع از داده های اصلی و غیر اصلی را میخواهید بگیرید
tool=int(input("Enter the Numbers for tol:"))
arz=int(input("Enter the arz:"))
#:حالا فرمول مساحت و محیط را مینویسیم
masahat=tool*arz
print("مساحت=",masahat)
mohit=(tool + arz)*2
print("محیط=",mohit)
"""-----------------------------------------------"""
#میتوان نوع داده ها را با گفتن نوع دلخواه تغیر داد
karo=19.56
print(int(karo))
""""  
    ------------------------------------------
        :عملگر های ریاضی در پایتون            |
        /   ------>تقسیم                      |
        *   ------>ضرب                        
        +   ------>جمع                        |
        -   ------>تفریق                        
        =   ------>انتساب                     |
        ==  ------>True or False
        %   ------>باقی مانده                 |
        //  ------>همان تقصیم اما قسمت صحیح
        **  ------>این به معنی توان است       |
    ------------------------------------------
"""
#(import)نکته:ما برای راحتی در اعمال خ.د از کتاب خانه های مخصوص هرکار استفاده میکنیم
# مثال:import math   ---->فرا خوانی کتابخانه ریاضی که شامل عدد پی یا نسبت های مثلثاتی و...میباشد
"""
تکلیف:ساخت برنامه ای که محیط و مساحت دایره را بدست بیاورد :و
(برای عدد پی از کتاب خانه استفاده کنید)
"""
#حل
import math
r=float(input("شعاع را وارد کنید:"))
pi=math.pi
masahat_circle=pi*r**2
mohit_circle=2*(pi*r)
print(int(masahat_circle) ,int(mohit_circle))
#به جای این عمل میتوان از دستور دیگری استفاده کرد تابگویید چند رقم اعششار احتیاج دارید
#اسم ان round
print(round(masahat_circle,2),round(mohit_circle,2))

"""_____________________________________________________________________________________________________________"""