""" گیت های منطقی:and,or,not
and ---->همه درست
or ---->همه غلط 
not ---->نقیض
|-------------------|
(if)ساختار های شرطی 
مثال: """
a=int(input("Enter integer number:\n"))
if a>=10 and a<=99:# و از andاستفاده شده منظور از (:)انگاه است
    print("two digit")#تو رفتگی در پایتون یک امر مهم میباشد و نمیتوان نگذاشت
else:#--->نبود این
    print("no,two digit")
"""___________________________________________
عدد زوج است یا فرد                 : جواب"""    
if a%2==0:
    print("زوج است")
else:
    print("فرد است")
"""
دو مساوی به معنای این است که برابر است اما تک مساوی به معنای انتساب است که در قبل خواندیم
و علامت!=
       |__>به معنای برابر نبودن است
علامت های دیگری هم ماننده >= و<=وجود دارد که کوچکت مساوی و بزرگ تر مساوی است 
که نکته ان است اول علامت کوچک تر بزرگ تر بعد مساوی بگذاریم
"""


"""______________________________________________________"""

""":برنامه ای بنویسید که بگوید افراد در چه رنج سنی قرار دارد"""
#حل
age=int(input("Enter the age"))
if age<=10 and age>=1:
    print("baby")
elif age>10 and age<=20:
    print("teenager")
elif age>20 and age<40:
    print("man")
elif age>=40 and age<=60:
    print("mosen")
elif age>=61 and age<=120:
    print("پیر")
else:
    print("Enteer the number True")
#نکته خیلی مهم این است که 
#elif
#بهتر از 
#if
#است زیرا در صورت درست بودن یکی / بقیه دیگر برسی نخواهد شدو در نتیجه پردازنده درگیر عملیات فراوان نمیشود
# اما حتما باید شرط باشد و بین شرط هم سطر ان نباید دستور بیخود باشد مگرنه الیف ارور میدهد
"""_______________________________________________________"""
"""برنامه ای بنویسید که مشخص کند فرد با توجه به نمره در چه رده ای قرار دارد"""
nomre_math=float(input("نمره را وارد کنید"))
if nomre_math==20:
    print("عالی")
elif nomre_math>=15:
    print("خیلی خوب")
elif nomre_math>=10:
    print("خوب")
elif nomre_math>=5:
    print('نیاز به تلاش')
elif nomre_math>=1:
    print("مشروط")
else :
    print("نمره درست را وارد کنید")
"""________________________________________________________"""
# برای مثال این لیست دو بعدی را پیمایش کرده و مجموع کل را محاسبه بکنید
a=[[0,1,2,3,4,5],
[5,4,8,0,4,9],
[45,78,95,45,87,12]]
c=0
for j in a:
    for i in j:    
        if i==',' or i==']' or i=='[':
            continue
        else:
            c+=i
print(c)
"""---------------------------------------"""